[
    {
        "text": "في حوكمة البيانات، ما هو المستوى المسؤول عن إدارة المبادرات؟",
        "options": [
            "المستوى التنفيذي.",
            "المستوى الاستراتيجي.",
            "المستوى التكتيكي.",
            "المستوى الداعم."
        ],
        "correct": 1,
        "hint": "المستوى التكتيكي يتولى تنفيذ وإدارة المبادرات والخطط التشغيلية."
    },
    {
        "text": "من أمثلة معالجة اللغة الطبيعية والذي يعد مجالاً خصباً في الذكاء الاصطناعي ................ .",
        "options": [
            "كشف مشاعر الكلام المكتوب.",
            "كشف الأورام في الصور الطبية.",
            "كشف إشارات التجسس.",
            "كشف محيط السيارات ذاتية القيادة."
        ],
        "correct": 0,
        "hint": "معالجة اللغة الطبيعية تهتم بالنصوص والمشاعر المكتوبة."
    },
    {
        "text": "من عيوب مخطط النجمة عدم التطبيع مما يسبب ...................... .",
        "options": [
            "عدم الاتساق.",
            "عدم التكرار.",
            "كثرة الوصلات.",
            "تركيبة معقدة."
        ],
        "correct": 0,
        "hint": "عدم التطبيع يؤدي إلى تكرار البيانات وبالتالي فقدان الاتساق."
    },
    {
        "text": "يساعد ..................... على اعطاء تصورات واضحة عن البيانات.",
        "options": [
            "تحليل البيانات الاستكشافي.",
            "تقييم النموذج.",
            "جمع البيانات وتجهيزها.",
            "التمثيل المرئي."
        ],
        "correct": 0,
        "hint": "التمثيل المرئي يعرض الأنماط والاتجاهات بشكل بصري واضح."
    },
    {
        "text": "المرحلة الأولى في دورة حياة علم البيانات هي ................... .",
        "options": [
            "التقييم.",
            "النمذجة.",
            "تحديد وتعريف المشكلة.",
            "جمع البيانات وتجهيزها."
        ],
        "correct": 2,
        "hint": "تبدأ دورة علم البيانات بتحديد المشكلة قبل جمع البيانات."
    },
    {
        "text": "ما هو الفرق بين 'التعلم الآلي' و'الذكاء الاصطناعي'؟",
        "options": [
            "التعلم الآلي هو نوع من الذكاء الاصطناعي يمكنه اتخاذ القرارات بدون بيانات.",
            "التعلم الآلي هو طريقة ضمن الذكاء الاصطناعي يستخدم لتعليم الأنظمة كيفية التعلم من البيانات.",
            "الذكاء الاصطناعي يعتمد فقط على التعليمات البرمجية، بينما التعلم الآلي يعتمد على البشر.",
            "لا يوجد فرق بينهما؛ المصطلحين متطابقين."
        ],
        "correct": 1,
        "hint": "التعلم الآلي فرع من الذكاء الاصطناعي يتعلم من البيانات لتطوير النماذج."
    },
    {
        "text": "ما هو 'التعلم الخاضع للإشراف' (Supervised Learning)؟",
        "options": [
            "نموذج يتم تدريبه باستخدام أمثلة من البيانات المصنفة (Labeled Data).",
            "نموذج يتم تدريبه باستخدام بيانات غير مصنفة (Unlabeled Data).",
            "نموذج يقوم بتحليل البيانات بدون تدخل بشري.",
            "نموذج يتم تدريبه على مجموعة بيانات تحتوي على أمثلة من جميع الفئات الممكنة."
        ],
        "correct": 0,
        "hint": "في التعلم الخاضع للإشراف يتم استخدام بيانات تحمل تسميات صحيحة أثناء التدريب."
    },
    {
        "text": "ما هو الغرض الرئيسي من تقسيم البيانات إلى مجموعة تدريب (Training Set) ومجموعة اختبار (Test Set)؟",
        "options": [
            "لتقييم أداء النموذج على بيانات غير مألوفة.",
            "لتقليل حجم البيانات التي يتعين على النموذج التعامل معها.",
            "لتحسين دقة النموذج على البيانات المتاحة.",
            "لزيادة حجم البيانات المتاحة."
        ],
        "correct": 0,
        "hint": "نستخدم مجموعة الاختبار لقياس مدى تعميم النموذج على بيانات جديدة."
    },
    {
        "text": "أي من المقاييس التالية يستخدم لتقييم أداء نماذج الانحدار (Regression)؟",
        "options": [
            "Mean Squared Error (MSE) متوسط ​​​​الخطأ المربع.",
            "Precision.",
            "Confusion Matrix (مصفوفة الارتباك).",
            "F1-Score."
        ],
        "correct": 0,
        "hint": "MSE يستخدم لقياس مدى دقة توقعات نموذج الانحدار."
    },
    {
        "text": "ما المقصود بجودة البيانات؟",
        "options": [
            "قدرة البيانات على شغل مساحة أقل في التخزين.",
            "مدى دقة واكتمال البيانات ومدى توافقها مع الاستخدام المطلوب.",
            "سرعة معالجة البيانات في الأنظمة.",
            "عدد مرات تحديث البيانات خلال فترة معينة."
        ],
        "correct": 1,
        "hint": "جودة البيانات تتعلق بالدقة والاكتمال والملاءمة للغرض."
    }
]
