[
    {
        "text": "هي مجموعة من الأساليب والتقنيات المستخدمة في علم الحوسبة وتعلم الآلة لاستخراج الأنماط والتعرف عليها في البيانات.",
        "options": [
            "أساليب التعرف على الأنماط.",
            "أساليب التعرف على الأصوات.",
            "أساليب التعرف على الأدوات.",
            "المصنف."
        ],
        "correct": 0,
        "hint": "تُستخدم أساليب التعرف على الأنماط لاكتشاف الأنماط والعلاقات داخل البيانات."
    },
    {
        "text": "هو عملية تجميع ميزات محددة داخل ميزات أكثر عمومية وشمولية.",
        "options": [
            "تقليل الأبعاد.",
            "التلخيص.",
            "التجريد.",
            "التجميع."
        ],
        "correct": 1,
        "hint": "التجريد هو تبسيط البيانات بتمثيلها بمفاهيم أعم وأشمل."
    },
    {
        "text": "تُعتبر أسلوبًا مهمًا في تمثيل وتحليل البيانات، حيث تهدف إلى إنشاء نموذج يقوم بتمثيل عملية تكوين البيانات.",
        "options": [
            "التجميع.",
            "نماذج التصنيف.",
            "نماذج الحفظ.",
            "نماذج التوليد."
        ],
        "correct": 3,
        "hint": "نماذج التوليد تهدف إلى فهم كيفية إنشاء البيانات وتمثيل توزيعها."
    },
    {
        "text": "............ يشير إلى الكميات الهائلة من البيانات المتولدة من مصادر متعددة. هذا الحجم يتجاوز القدرات التقليدية للتخزين والمعالجة والتحليل.",
        "options": [
            "البيانات الضخمة.",
            "البيانات الضئيلة.",
            "البيانات الإحصائية.",
            "البيانات النصية."
        ],
        "correct": 0,
        "hint": "البيانات الضخمة تُخزن وتُحلل باستخدام تقنيات متقدمة بسبب حجمها وسرعتها وتنوعها."
    },
    {
        "text": "........... يساعد في فهم مدى التباين في البيانات وكيفية تأثير هذا التباين على النتائج واتخاذ القرارات.",
        "options": [
            "اختبار الفرضيات.",
            "تحليل الانحراف.",
            "الإحصاء الوصفي.",
            "الانحدار."
        ],
        "correct": 1,
        "hint": "الانحدار يستخدم لتحليل العلاقة بين المتغيرات والتنبؤ بالقيم المستقبلية."
    },
    {
        "text": "تُستخدم الشبكات العصبية المتكررة في التطبيقات المعاصرة مثل المساعدين الصوتيين (ألكسا و سيري).",
        "options": [
            "الشبكات المعززة.",
            "الشبكات العصبية ذات الترميز التلقائي.",
            "الشبكات العصبية التلافيفية.",
            "الشبكات العصبية المتكررة."
        ],
        "correct": 3,
        "hint": "الشبكات العصبية المتكررة (RNN) ممتازة في التعامل مع البيانات المتتابعة مثل الصوت والنص."
    },
    {
        "text": "هو الفرع الآخر من الإحصاء وهو يرتكز على استخدام البيانات الوصفية لاتخاذ قرارات أو استنتاجات بشكل أكثر تعقيدًا وعمقًا.",
        "options": [
            "الإحصاء الوصفي.",
            "الانحدار.",
            "البيانات الإحصائية.",
            "الإحصاء الاستدلالي."
        ],
        "correct": 3,
        "hint": "الإحصاء الاستدلالي يهدف إلى التنبؤ واتخاذ القرارات بناءً على عينات البيانات."
    },
    {
        "text": "من الأمثلة على ميزات النص:",
        "options": [
            "طول الجمل والفقرات.",
            "مستوى الإضاءة والظلال.",
            "القيم الإحصائية.",
            "تواجد الحواف والزوايا."
        ],
        "correct": 0,
        "hint": "تحليل النص يعتمد على خصائص مثل الطول، الكلمات المتكررة، والبنية اللغوية."
    },
    {
        "text": "………….. هو كمبيوتر متصل دائمًا ويسمح لمستخدمه بالوصول إلى الإنترنت للحصول على جميع أنواع المعلومات أثناء التنقل.",
        "options": [
            "الشاشة.",
            "الفأرة.",
            "الهاتف الذكي.",
            "الخوارزميات."
        ],
        "correct": 2,
        "hint": "الهاتف الذكي يُعد جهازًا متصلًا بالإنترنت ومحمولًا دائمًا."
    },
    {
        "text": "يعتمد .................. على استخراج الأنماط والترتيبات من البيانات بشكل ذاتي، مما يساعد في استكشاف البيانات وفهمها بصورة أعمق.",
        "options": [
            "التعليم الموجه.",
            "التعليم المعزز.",
            "التعلم غير الموجه.",
            "التعليم الذاتي."
        ],
        "correct": 2,
        "hint": "التعلم غير الموجه يستخدم عندما لا تتوفر تسميات مسبقة للبيانات."
    }
]
